Конфигурация/Catalogs/СертификатыКлючейЭЦП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>СертификатыКлючейЭЦП</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдостоверяющийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеСертификата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Enums/ВидыЮрФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыЮрФизЛиц</Name>
			<Comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Catalogs/СертификатыКлючейЭЦП/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыСправочника(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыСправочника(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	// блокирующие проверки
	Если Не ЭтотОбъект.ПометкаУдаления Тогда
		
		УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ);
		
		// период должен быть корректен
		Если ЭтотОбъект.НачалоДействия > ЭтотОбъект.ОкончаниеДействия Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата начала действия сертификата больше даты окончания", ЭтотОбъект, "ОкончаниеДействия",, Отказ);
		КонецЕсли;
		
		// субъектом м.б. только физик, а УЦ - юрик
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Субъект, "ВидЮрФизЛица") <> Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Субъект может быть только физическое лицо", ЭтотОбъект, "ОкончаниеДействия",, Отказ);
		КонецЕсли;
		
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.УдостоверяющийЦентр, "ВидЮрФизЛица") <> Перечисления.ВидыЮрФизЛиц.ЮридическоеЛицо Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Удостоверяющим центром может быть только юридическое лицо", ЭтотОбъект, "УдостоверяющийЦентр",, Отказ);
		КонецЕсли;
		
		// проверим уникальность серийного номера
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СертификатыКлючейЭЦП.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.СертификатыКлючейЭЦП КАК СертификатыКлючейЭЦП
			|ГДЕ
			|	СертификатыКлючейЭЦП.Организация = &Организация
			|	И СертификатыКлючейЭЦП.СерийныйНомер = &СерийныйНомер
			|	И СертификатыКлючейЭЦП.Ссылка <> &Ссылка";
		
		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("СерийныйНомер", ЭтотОбъект.СерийныйНомер);
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Серийный номер сертификата не уникален", ЭтотОбъект, "СерийныйНомер",, Отказ);
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры // ПередЗаписью
